# MultistoryStairsAutomaticLevelLandingsDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MultistoryStairsAutomaticLevelLandingsDeleted Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Level landings are deleted because the connected stairs have been regenerated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultistoryStairsAutomaticLevelLandingsDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStairsAutomaticLevelLandingsDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultistoryStairsAutomaticLevelLandingsDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace